package days03;

/*
 연산자(operator)
	1. 정의: 연산을 수행하는 기호
	예) + - * / % 등등
	
	2. 피연산자(operand) : 연산의 대상
	예) 3 + 5 ==> true/false가 나오는 식을 조건식이라 함.(참/거짓으로 나눌 수 있는 식)
		+ : 산술연산자 중 덧셈 연산자
		3, 5 : 피연산자
		
	3. 표현식(expression) : 수[식], 조건[식] 
		연산자와 피연산자를 조합하여 계산하고자 하는 바를 표현한 것.
	
	4. 연산자 종류
		1) 기능에 따라 구분
			산술연산자 4-2.java
			비교연산자 4-3.java
			논리연산자 4-4.java
			대입연산자
			등등
		
		2) 피연산자의 갯수에 따라서 구분
			단항연산자(항이 1개 - 예) -3)		4-5.java
			이항연산자(항이 2개 - 예) 덧셈)
			삼항연산자(항?항:항 - 조건연산자)	4-6.java
			사항연산자는 없음 X
			
			
			
	
*/


public class Ex04 {

	public static void main(String[] args) {
		

	}

}
