package days01;

/**
 * @author kenik
 * @date 2024. 12. 23. - 오후 4:22:18
 * @subject 자바 프로그램의 기본 구조
 * @content 1.
 *          2.
 */
public class Ex02 {  // 시작 개체
	
	public static void main(String[] args) {
		// 1. 자바 프로그램의 기본 구조 (5번 문제)
		/*  
		 *   1) 자바는 "객체 지향적 프로그램 언어"이기 때문에
		 *            (Object  Oriented Programming)
		 * 
		 *   2) 객체==개체==Object==물건==클래스==부품
		 *      시작 객체(개체) == 클래스 1개 선언
		 *      ㄱ. 자바 클래스 선언 형식 ( 암기 )
		 *      [접근지정자] [기타제어자] class키워드 클래스명{
		 *            modifiers
		 *      }
		 *      ㄴ. 클래스명은 반드시 대문자로 시작한다. 
		 *      ㄷ. 반드시 자바파일명(클래스명.java)과 클래스명은 동일해야 한다.   
		 *   3) 시작 개체로 사용되는 클래스는 반드시 진입점(entry point)을 
		 *     가져야 하고 main 메서드(method, 함수)를 선언해야 한다.
		 *      ㄱ. 메서드(함수==기능(일))를 선언 형식 ( 암기 )
		 *       [접근지정자] [기타제어자] 리턴자료형 main(paramer, args) {
		 *       }
		 *       예) 윤형식 쉬는 시간 담배 심부름..ㅣ
		 *          일(담배심부름) + 머니, 담배명 = 파라미터,인자, 매개변수
		 *          반환값          담배
		 * 
		 * */
	}

}
