package days01;

/**
 * @author kenik
 * @date 2024. 12. 23. - 오후 4:21:07
 * @subject  변수와 상수
 * @content  상수와 리터럴( literal ) 설명
 *           - 상수 : 기억공간 + 초기화  값X
 *           - 리터럴 : 100  'A' 3.14 true
 */
public class Ex04 {

	public static void main(String[] args) {
		
		// 변수 - 변하는 수 , 값을 변경할 수 있는 기억공간
		// [상수 - 고정된 수 , 값을 변경할 수 없는 기억공간]
		
		// [ 상수 선언 형식 ]
		// final
		
		final double PI = 3.141592;
		/*
		반지름 * pi;
		반지름 * pi;
		반지름 * pi;
		반지름 * pi;
		반지름 * pi;
		반지름 * pi;
		반지름 * pi;
		반지름 * pi;
		반지름 * pi;
		반지름 * pi;
		*/ 
		// pi = 5.14;
		/*
		반지름 * 3.141592;
		반지름 * 3.141592;
		반지름 * 3.141592;
		반지름 * 3.141592;
		반지름 * 3.141582;
		반지름 * 3.141592;
		반지름 * 3.141592;
		반지름 * 3.141592;
		반지름 * 3.141592;
		반지름 * 3.141592;
		 */ 

	} // main

} // class
